cases/bubbleColumn/constant/flotationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      flotationParticleProperties;
}

rho                 1E4;
Sct                 1.0;

continuousPhaseName water;
dispersedPhaseName  air;

sectionalDistribution
{
    type        sectionalList;
    diameters   (1e-9 1e-8 1e-7 1e-6 1e-5 1e-4);
}

particleVelocityModel
{
    type        localEquilibrium;
    steadyState true;
}

BrownianDiffusivityModel
{
    type        StokesEinstein;
}

efficiencyModels
{
    collisions
    {
        type    YoonLuttrellIntermediate;
    }
    attachment
    {
        type    YoonLuttrellIntermediate;

        inductionTime
        {
            type    Dai;
            A       0.2;
            B       0.6;
        }
    }
    stabilization
    {
        type    ideal;
    }
}

interactionModels
{
    attachment
    {
        deterministic
        {
            type    spherical;
        }
        stochastic
        {
            type    none;
        }
        Brownian
        {
            type    infiniteSink;

            SherwoodCorrelation
            {
                type    RanzMarshall;
            }
        }
    }
    detachment
    {
        stochastic
        {
            type    none;
        }
    }
}
