cases/bubbleColumn/0.org/U.air
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.air;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.23 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.air;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
    empties
    {
        type            empty;
    }
}
